export const carOptions = {
	salon: ['Тёмный', 'Светлый', 'Комби'],
	material: ['Натуральная кожа', 'Искусственная кожа', 'Ткань', 'Велюр', 'Алькантара', 'Комби'],
	safety: ['ABS', 'ESP', 'Иммобилайзер', 'Сигнализация', 'Антипробуксовочная'],
	airbags: ['Передние', 'Боковые', 'Задние'],
	assistance: ['Датчик дождя', 'Контроль мёртвых зон на зеркалах', 'Камера заднего вида', 'Парктроники'],
	exterior: ['Лёгкосплавные диски', 'Рейлинги на крыше', 'Фаркоп'],
	interior: ['Чёрный потолок', 'Панорамная крыша', 'Люк'],
	climate: ['Кондиционер', 'Климат-контроль', 'Раздельный климат-контроль'],
	lights: ['Ксеноновые', 'Противотуманные', 'Светодиодные'],
	heating: ['Лобового стекла', 'Зеркал', 'Руля', 'Сидений', 'Автономный отопитель'],
	multimedia: ['AUX или iPod', 'Bluetooth', 'Навигационная система', 'CD и MP3', 'USB', 'Мультимедийный экран'],
	comfort: ['Автозапуск двигателя', 'Управление мультимедия с руля', 'Передние электро-стеклоподъёмники', 'Задние электро-стеклоподъёмники', 'Круиз-контроль', 'Электрорегулировка сидений'],
 };